app/Http/Controllers/website/contactusController.php

    public function store(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'name' => 'required|string|max:255',
            'email' => 'required|email|max:255',
            'phone' => 'required|string|max:20',
            'address' => 'nullable|string|max:255',
            'message' => 'nullable|string',
            'g-recaptcha-response' => 'required',
        ]);

        if ($validator->fails()) {
            return redirect()->back()
                ->withErrors($validator)  // Pass the validation errors to the view
                ->withInput();           // Pass the old input data to the view
        }

        // Store the form data in the database
        $contact = new Contact();
        $contact->name = $request->input('name');
        $contact->email = $request->input('email');
        $contact->phone = $request->input('phone');
        $contact->address = $request->input('address');
        $contact->message = $request->input('message');
        $contact->save();
---
insert into `contacts` (`name`, `email`, `phone`, `address`, `message`, `updated_at`, `created_at`) values ('nabeel', 'nabeel@admin.com', '03046035644', 'allama iqbaal', 'please contact me', '2023-12-08 17:17:04', '2023-12-08 17:17:04')