app/Http/Controllers/website/QouteController.php

select * from `devices`
---
    public function index()
    {

        $devices = Device::all();

select * from `manufacturers` where `device_id` = '6'
---
    public function storeDevice(Request $request)
    {
        $device_id = $request->input('device_id');
        // dd($device_id);
        session(['selected_device_id' => $device_id]);

        // Retrieve manufacturers based on the selected device_id
        $manufacturers = Manufacturer::where('device_id', $device_id)->get();

select * from `issues` where `model_id` = '4'
---
    public function storeModel(Request $request)
    {
        $model_id = $request->input('model_id');
        session(['selected_model_id' => $model_id]);

        // Retrieve issues based on the selected model_id
        $issues = Issue::where('model_id', $model_id)->get();

select * from `devices` where `id` = '6' limit 1
select * from `manufacturers` where `id` = '4' limit 1
select * from `models` where `id` = '4' limit 1
select * from `issues` where `id` in ('1', '2')
---
    public function storeOrderData()
    {
        $selectedDeviceId = session('selected_device_id');
        $selectedManufacturerId = session('selected_manufacturer_id');
        $selectedModelId = session('selected_model_id');
        $selectedIssues = session('selected_issues');
        $selectedLocation = session('selected_location');

        // Retrieve manufacturers based on the selected device_id
        $device = Device::where('id', $selectedDeviceId)->first();
        $manufacturer = Manufacturer::where('id', $selectedManufacturerId)->first();

        // Retrieve models based on the selected manufacturer_id
        $model = Model::where('id', $selectedModelId)->first();

        // Retrieve issues based on the selected model_id
        $issues = Issue::whereIn('id', $selectedIssues)->get();

insert into `orders` (`order_no`, `device_id`, `manufacturer_id`, `model_id`, `location`, `total_price`, `customer_name`, `customer_email`, `customer_phone`, `contact_through`, `message`, `payment_status`, `status`, `updated_at`, `created_at`) values ('657357', '6', '6', '7', 'ቦሌ አለምአቀፍ አየር ማረፊያ, Hasenbarihemoo581@gmail.com 94303, 1600, Ethiopia', '90', 'faiz', 'faiz@gmail.com', '03205452144', 'email', 'please get me this', 'unpaid', 'on_hold', '2023-12-08 17:51:40', '2023-12-08 17:51:40')
select * from `issues` where `id` in ('7')
insert into `ordered_issues` (`order_id`, `issue_id`, `issue_name`, `issue_price`, `issue_timeframe`, `issue_warranty`, `updated_at`, `created_at`) values (6, 7, 'Camera', '90.00', '2 hours', '8 months', '2023-12-08 17:51:40', '2023-12-08 17:51:40')
---
    public function store(Request $request)
    {
        // Retrieve data from the session
        $selectedDeviceId = session('selected_device_id');
        $selectedManufacturerId = session('selected_manufacturer_id');
        $selectedModelId = session('selected_model_id');
        $selectedIssues = session('selected_issues');
        $selectedLocation = session('selected_location');

        // Validate the request data
        $validator = Validator::make($request->all(), [
            'contact_through' => 'required|in:phone,whatsapp,email',
            'customer_name' => 'required|string',
            'customer_email' => 'required|email',
            'customer_phone' => 'required|string',
            'total_price' => 'required|numeric',
            // Add other validation rules as needed
        ]);

        if ($validator->fails()) {
            return redirect()->back()
                ->withErrors($validator)  // Pass the validation errors to the view
                ->withInput();           // Pass the old input data to the view
        }

        $orderNo = time() . rand(1000, 9999);
        // dd($orderNo);
        // Create a new Order instance
        $order = Order::create([
            'order_no' => $orderNo,
            'device_id' => $selectedDeviceId,
            'manufacturer_id' => $selectedManufacturerId,
            'model_id' => $selectedModelId,
            'location' => $selectedLocation,
            'total_price' => $request->input('total_price'),
            'customer_name' => $request->input('customer_name'),
            'customer_email' => $request->input('customer_email'),
            'customer_phone' => $request->input('customer_phone'),
            'contact_through' => $request->input('contact_through'),
            'message' => $request->input('message'),
            'payment_status' => 'unpaid', // Assuming it's unpaid by default
            'status' => 'on_hold', // Assuming it's unpaid by default
        ]);
        $issues = Issue::whereIn('id', $selectedIssues)->get();
        // Create OrderedIssue instances for each selected issue
        foreach ($issues as $issue) {
            OrderedIssue::create([
                'order_id' => $order->id,
                'issue_id' => $issue->id,
                'issue_name' => $issue->name, // Replace with actual data
                'issue_price' => $issue->price, // Replace with actual data
                'issue_timeframe' => $issue->timeframe, // Replace with actual data
                'issue_warranty' => $issue->warranty, // Replace with actual data
            ]);