app/Http/Controllers/dashboard/ContactController.php

select * from `contacts`
---
    public function index()
    {
        $contacts = Contact::all();

select * from `contacts` where `contacts`.`id` = '2' limit 1
delete from `contacts` where `id` = 2
---
    public function destroy(string $id)
    {
        $contact = Contact::find($id);

        if (!$contact) {
            return redirect()->route('contacts.index')->with('error', 'Contact not found');
        }

        $contact->delete();