app/Http/Controllers/dashboard/OrderController.php

    public function index()
    {
        $orders = Order::with([
            'model' => function ($query) {
                $query->select('id', 'name');
            }
        ])->get();
---
select `id`, `name` from `models` where `models`.`id` in (4, 5, 7)

    public function edit(string $id)
    {

        // Retrieve the order with its related models
        $order = Order::with('device', 'manufacturer', 'model', 'orderedIssues','technician')->find($id);
---
select * from `devices` where `devices`.`id` in (6)
select * from `manufacturers` where `manufacturers`.`id` in (5)
select * from `models` where `models`.`id` in (5)
select * from `ordered_issues` where `ordered_issues`.`order_id` in (3)

    public function updateStatus(Request $request, $id)
    {

        $request->validate([
            'status' => 'required|in:on_hold,processing,completed,cancelled',
        ]);

        $order = Order::findOrFail($id);
        $order->update(['status' => $request->input('status')]);
---
select * from `orders` where `orders`.`id` = '3' limit 1
update `orders` set `status` = 'completed', `orders`.`updated_at` = '2023-12-08 16:48:12' where `id` = 3

    public function updatePaymentStatus(Request $request, $id)
    {

        $request->validate([
            'payment_status' => 'required|in:paid,unpaid',
        ]);

        $order = Order::findOrFail($id);
        $order->update(['payment_status' => $request->input('payment_status')]);
---
select * from `orders` where `orders`.`id` = '3' limit 1
update `orders` set `payment_status` = 'paid', `orders`.`updated_at` = '2023-12-08 16:54:15' where `id` = 3